{
  "name": "Gestão Pro ",
  "description": "SYSTEM INSTRUCTIONS (PT-BR) — PROJETO DEPÓSITO DE GÁS\n0) Idioma e comportamento obrigatório\n\nResponda sempre em Português (Brasil), inclusive nomes de botões, mensagens e comentários no código.\n\nNão traduza automaticamente para inglês. Se algum texto sair em inglês, refaça em PT-BR.\n\nSeja objetivo, preciso e determinístico: sem “talvez”, sem suposições. Se faltar dado, proponha defaults seguros.\n\nAntes de gerar código, produza um Checklist do que vai mudar e Checklist do que não pode quebrar.\n\nNunca quebre o que já está funcionando. Alterações devem ser incrementais, com migrations e compatibilidade.\n\n1) Stack e objetivo do produto\n\nAplicação em React + TypeScript com UI (Tailwind/shadcn se já estiver no projeto).\n\nDeve funcionar offline-first com persistência local (ex.: IndexedDB via Dexie, ou SQLite local via wrapper se for desktop).\n\nO sistema precisa ter arquitetura pronta para futuramente ser online/sincronizável, mas sem depender de internet para operar.\n\n2) Conceitos fixos do domínio\n2.1 Depósitos (3 depósitos)\n\nExistem 3 depósitos físicos: Depósito 1, Depósito 2, Depósito 3.\n\nTodo estoque e toda movimentação operacional deve estar vinculada a um depósito.\n\nUsuário logado tem um deposito_id (1..3) e por padrão só enxerga/atua no próprio depósito.\n\n2.2 “Pessoal” (somente financeiro)\n\nExiste a dimensão “Pessoal” que é APENAS FINANCEIRO.\n\n“Pessoal” não possui estoque e não é filtro de estoque.\n\n“Pessoal” serve para despesas/receitas pessoais do ADM, separadas dos depósitos, mas aparecendo em relatórios financeiros quando selecionado.\n\n2.3 ADM vs Colaborador (permissões)\n\nColaborador/Caixa:\n\nOpera O.S, estoque, suprimento, sangria, contagem, ajustes e transferências do seu depósito.\n\nPode cadastrar cliente (dados básicos), mas não vê preços personalizados.\n\nAdministrador:\n\nEnxerga tudo: os 3 depósitos, consolidado, e “pessoal” (financeiro).\n\nConfigura produtos, preços gerais, formas de pagamento, maquininhas, juros, categorias, alertas, auditoria, clientes e preços personalizados.\n\n3) O.S (Ordem de Serviço) e vendas\n3.1 Regra central\n\nToda venda é registrada como O.S. Uma O.S concluída impacta:\n\nFinanceiro (entrada/recebimento)\n\nEstoque (baixa/alta conforme modalidade)\n\nO estoque só deve ser realmente atualizado quando a O.S for marcada como Concluída (regra já existente no sistema antigo).\n\n3.2 Modalidades de venda\n\nExistem modalidades (ex.: Venda, Troca, Recarga/Casco, etc.).\n\nCada modalidade deve:\n\nDefinir como movimenta o estoque (cheios/vazios, cascos, água etc.)\n\nDefinir como gera financeiro\n\nNão inventar modalidades novas sem solicitação. Manter as existentes e permitir expansão.\n\n4) Estoque (por depósito)\n4.1 Estoque real\n\nEstoque é por depósito e por produto.\n\nAjustes e movimentações devem gerar log/auditoria: quem, quando, depósito, produto, quantidade, motivo, tipo (entrada/saída/transferência/ajuste).\n\n4.2 Contagem de conferência (não altera estoque real)\n\nExiste um fluxo obrigatório de contagem manual no início e no fechamento do caixa:\n\nA contagem é apenas conferência, não altera o estoque real.\n\nDeve ser salva e aparecer no relatório final de fechamento, com opção de imprimir.\n\nIsso é diferente de:\n\nSuprimento/Entrada, Sangria/Saída, Ajuste manual (estes alteram o estoque real, e continuam “EXATAMENTE COMO ESTÁ”).\n\n4.3 Transferência entre depósitos\n\nNa tela de transferência, o usuário deve conseguir selecionar origem e destino (depósitos 1..3) e registrar o motivo.\n\nMesmo que o usuário seja do Depósito 1, ele pode registrar uma transferência para Depósito 2 ou 3 (com log).\n\n4.4 Estoque mínimo e alertas por depósito\n\nCada produto tem “estoque mínimo” por depósito.\n\nAlertas devem ser gerados por depósito:\n\nExemplo: “Gás P13 — Depósito 2 — 20 unidades (abaixo do mínimo)”.\n\nDeve existir interruptor (toggle) para ligar/desligar:\n\nalertas de estoque mínimo por produto\n\nalertas financeiros\n\nAlterações feitas na UI devem persistir de verdade (nunca “some ao reabrir”).\n\n4.5 Visão consolidada de estoque (ADM)\n\nO sistema deve exibir para o Administrador:\n\nEstoque por depósito (Depósito 1, 2 e 3 separadamente)\n\nEstoque total consolidado = soma do Depósito 1 + Depósito 2 + Depósito 3, por produto.\n\n“Consolidado” não é um depósito e não pode receber movimentações. É somente uma visão/consulta.\n\nFiltros de estoque para o ADM devem incluir:\n\n“Depósito 1”\n\n“Depósito 2”\n\n“Depósito 3”\n\n“Todos os Depósitos (Consolidado)”\n\nEm alertas de estoque mínimo:\n\nO alerta principal é por depósito (porque o mínimo é por depósito).\n\nOpcionalmente, pode existir um indicador secundário mostrando o total consolidado do mesmo produto, mas sem substituir o alerta por depósito.\n\n5) Financeiro\n5.1 Contas a pagar e categorias\n\nDeve existir cadastro/edição/remoção de categorias (ex.: Água/Esgoto, Energia, Aluguel, Folha, Encargos etc.) com opção “Outros”.\n\nRemover opções repetidas; categorias devem ser únicas (normalização).\n\nContas a pagar devem permitir vincular a:\n\nDepósito 1/2/3 ou\n\n“Pessoal” (somente financeiro, sem estoque)\n\n5.2 Contas a receber (a prazo)\n\nFormas de pagamento podem ser marcadas como:\n\nÀ vista (entra no caixa/recebimento imediato)\n\nA prazo (gera lançamento em Contas a Receber)\n\nContas a receber precisam:\n\nfiltro por cliente (quanto “Supermercado X” deve)\n\nregistro de pagamentos parciais com data/hora e histórico\n\nvínculo com O.S de origem (data da compra, valores)\n\n5.3 Formas de pagamento e maquininhas (configurável via UI)\n\nADM pode:\n\ncadastrar/editar/remover formas de pagamento\n\ncadastrar maquininhas com:\n\nnome (ex.: “Azulzinha”, “Stone”)\n\ntaxas/juros por tipo de recebimento (débito/crédito 1x/2x/…)\n\nquais depósitos podem usar aquela maquininha\n\nAo salvar, deve aparecer na listagem e persistir.\n\n6) Clientes e preços personalizados (ADM)\n6.1 Cadastro de cliente (colaborador)\n\nCampos: nome, endereço, referência (opcional), CPF (opcional), aniversário (opcional).\n\nCliente pode ser vinculado a uma O.S.\n\n6.2 Gestão de clientes (ADM)\n\nADM vê lista, edita dados, consulta histórico:\n\ntotal comprado, ranking de clientes\n\nfiltros de período (15 dias, 1 mês, custom)\n\nmédia de intervalo entre compras\n\nticket médio (valor médio por compra)\n\n6.3 Preço personalizado por cliente\n\nADM pode configurar por cliente:\n\npreços personalizados para todos os produtos e todas as modalidades (Venda/Troca/Casco/etc.)\n\nopção “usar preço padrão” por item (fallback)\n\nFuncionários não veem os valores; apenas que “existe preço especial” e o sistema aplica automaticamente.\n\n6.4 Desconto de uso único (cupom interno)\n\nADM pode marcar “criar desconto na próxima venda”:\n\ndesconto pode ser em valor (R$) ou percentual (%)\n\no desconto é uso único: ao aplicar em 1 venda, automaticamente expira e volta ao preço normal.\n\nO sistema deve aplicar automaticamente na próxima O.S desse cliente.\n\n7) Auditoria, alertas e relatórios\n\nToda ação crítica gera log:\n\nestoque (ajuste, suprimento, sangria, transferência)\n\nfinanceiro (contas a pagar/receber, baixas, parciais)\n\nconfigurações (pagamentos, maquininhas, categorias, mínimos)\n\n“Relatório de caixa” para ADM: deve mostrar as mesmas informações que o operador vê ao fechar caixa.\n\nAlertas:\n\ncentro de alertas com comparativos (semanal/mensal) e avisos\n\nsuporte a alertas por tempo (ex.: O.S demorando) com opcional de som/narração (planejar arquitetura; implementar depois se pedido).\n\nQualquer “som/narração” deve ser configurável (toggle) e nunca travar o app.\n\n8) Regras de implementação e estabilidade\n\nPersistência local: nenhuma configuração pode “sumir” ao fechar tela.\n\nSempre usar IDs estáveis, evitar duplicidades:\n\ncategorias únicas\n\npagamentos únicos\n\nlogs com IDs e timestamps\n\nNão apagar dados críticos; preferir “inativar” quando apropriado.\n\nEntregar sempre:\n\nlista de arquivos alterados\n\nmigrations/atualização de schema (se aplicável)\n\ntestes manuais (passo a passo) para validar",
  "requestFramePermissions": [
    "geolocation"
  ]
}